Revit 2027 API
WireDistributionDirection Enumeration
 Defines the direction of the distribution of wires in a Fabric Sheet.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum WireDistributionDirection
Public Enumeration WireDistributionDirection
public enum class WireDistributionDirection
type WireDistributionDirection
Members
Member name | Value | Description
Major | 0 |  Wires are distributed in the Major direction.
Minor | 1 |  Wires are distributed in the Minor direction.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace